# Clean & Git

# 1. Cleaning Part

# Dataset

In [305]:
#import libarires
import pandas as pd
import numpy as np

In [306]:
# load the dataset & show first 5 rows
df=pd.read_csv('Bank_Customer.csv')
df.head(20)

     age           job   marital  education  balance duration
0   58.0    management   married   tertiary     2143      261
1   44.0    technician    single  secondary       29      151
2   33.0  entrepreneur   married  secondary        2       76
3   47.0   blue-collar   married    unknown     1506       92
4   33.0       unknown    single    unknown        1      198
5   35.0    management   married   tertiary      231      139
6   28.0    management    single   tertiary      447      217
7   42.0  entrepreneur  divorced   tertiary        2      380
8   58.0       retired   married    primary      121       50
9   43.0    technician    single  secondary      593       55
10  41.0        admin.  divorced  secondary      270      222
11  29.0        admin.    single  secondary      390      137
12  53.0    technician   married  secondary        6      517
13  58.0    technician   married    unknown       71       71
14  57.0      services   married  secondary      162      174
15  51.0       retired   married    primary      229      353
16  45.0        admin.    single    unknown       13       98
17  57.0   blue-collar   married    primary       52       38
18  60.0       retired   married    primary       60      219
19  33.0      services   married  secondary        0       54

In [307]:
# have an overview about the data using .info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1090 entries, 0 to 1089
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        1000 non-null   float64
 1   job        1090 non-null   object
 2   marital    1090 non-null   object
 3   education  1090 non-null   object
 4   balance    1090 non-null   int64
 5   duration   1090 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 51.2+ KB

In [308]:
# summarize what is wrong with your data !! (hint: Missing_values)
df.describe()

               age       balance
count  1000.000000   1090.000000
mean     42.582000    564.387156
std       9.070035   2553.749723
min      22.000000   -932.000000
25%      35.000000     22.000000
50%      42.000000    173.000000
75%      50.000000    443.500000
max      61.000000  58544.000000

# Dealing with missing values:

hint: Impute NaN in age column
BONUS: solve it with two imputing ways.

In [317]:
# First Methodology:
df.age.fillna(0)

0       58.0
1       44.0
2       33.0
3       47.0
4       33.0
        ...
1085     0.0
1086     0.0
1087     0.0
1088     0.0
1089     0.0
Name: age, Length: 1090, dtype: float64

In [322]:
# Second Methodology
df.age.fillna(method ='bfill',inplace=True)

# Run df.isna().sum() to make sure no more missing values.

_Hint: Don't Forget those hidden ones.
use .unique() or .value_counts() for help.

In [323]:
df.isna().sum()

age          90
job           0
marital       0
education     0
balance       0
duration      0
dtype: int64

In [324]:
df.age.unique()

array([58., 44., 33., 47., 35., 28., 42., 43., 41., 29., 53., 57., 51.,
       45., 60., 56., 32., 25., 40., 39., 52., 46., 36., 49., 59., 37.,
       50., 54., 55., 48., 24., 38., 31., 30., 27., 34., 23., 26., 61.,
       22., nan])

In [325]:
df.age.value_counts()

40.0    52
37.0    45
33.0    44
38.0    42
42.0    40
39.0    40
44.0    36
55.0    36
36.0    35
43.0    35
46.0    34
35.0    33
31.0    33
34.0    33
32.0    29
57.0    29
53.0    29
47.0    29
41.0    27
49.0    27
30.0    26
51.0    25
29.0    25
54.0    24
48.0    23
50.0    22
59.0    21
52.0    21
45.0    20
56.0    20
58.0    18
60.0    14
28.0    10
26.0     5
27.0     5
24.0     5
25.0     3
23.0     2
61.0     2
22.0     1
Name: age, dtype: int64

# Check for duplicates if exist.

In [326]:
df.duplicated().sum()

0

# Go on your work by cleaning the duration column.

In [327]:
df.duration.value_counts()

179     9
zero    9
262     8
112     8
144     8
       ..
683     1
802     1
70      1
316     1
165     1
Name: duration, Length: 481, dtype: int64

In [329]:
df["duration"] = pd.to_numeric(df["duration"])

ValueError: Unable to parse string "zero" at position 110

In [330]:
df['duration'] = df['duration'].replace({'zero':0})

In [331]:
df['duration'] = df['duration'].astype(int)

In [332]:
df.duration.value_counts()

0       9
179     9
262     8
144     8
174     8
       ..
398     1
401     1
49      1
404     1
2033    1
Name: duration, Length: 481, dtype: int64

In [333]:
df.duration.unique()

array([ 261,  151,   76,   92,  198,  139,  217,  380,   50,   55,  222,
        137,  517,   71,  174,  353,   98,   38,  219,   54,  262,  164,
        160,  342,  181,  172,  296,  127,  255,  348,  225,  230,  208,
        226,  336,  242,  365, 1666,  577,  180,   22, 1492,  616,  355,
        363,  266,  253,  179,  787,  145,  104,   13,  185, 1778,  138,
        812,  391,  357,   91,  528,  273,  158,  177,  258,  154,  291,
        176,  211,  349,  272,  193,  212,   20, 1042,  246,  529, 1467,
       1389,  188,   48,  213,  583,  221,  173,  426,  287,  101,  203,
        197,  257,  124,  229,  400,  190,   21,  514,  849,    0,  144,
        286,  107,  247,  518,  364,  178,  439,   79,  120,  175,   61,
         78,  143,  579,  677,  345,  100,  125,  136,   73,  541,  163,
        301,   46,  204,  157,  243,  186,  610, 2033,   85,  114,   57,
        238,   93,  128,  303,  558,  270,  228,   99,  240,  673,  233,
       1056,  250,  252,  130,  412,   19,  458,  717,  313,  683, 1077,
        416,  146,  167,  315,  140,  346,  562,  142,   67,  309,  248,
        256,   82,  477,  611,  471,  381,   42,  251,  408,  215,  216,
        366,  210,  288,  168,  338,  410,  300, 1419,   27,   18,  730,
        746,  121,   40,  206,  389,  702,  117,  232,   39,  282,  714,
        227,  119,  361,  350,  332,  113,  132,   58,   89,  152,  110,
        463,  962,   10,  118,  189,  234,   75,  621,  310,  156,    5,
          2,  742,  362,  200,  126,   65,  267,  209,  205,   83,  106,
        105,  108,  311,  214,  358,  453,  386,  241,  224,  148,  196,
        111,  231,  316,  425,  135,  402,  183,  325,  503,   95,  680,
        421,  808,  195,  347,  404,  396,   88,  379,  102,  306,  218,
        344,  652,  184,  235,  290,  133,  318,  260,  437,  501, 1201,
       1030,  149,  769,  199,  424,   43,  326,  393,  483,  259,  576,
         90,  505,  245,  623,  496,  276,   87,  744,  765,  150,  112,
        278, 1623,  354,  187,  451,  159,  409,  170,  608,   53,  134,
        678,  182,  162,  699,   97, 1677,  283,  323,   47,   30,  472,
        448,  264,  169,  337,  374,  531,  153,   80,  918,  269,  371,
        427,  604,  263,  129,  191,   26,  289,  123,  161,  268,  383,
        440,   23, 1297,   69,  524,   96,  155,  352,  390,  369,  341,
        526,   36, 1906,  147,  407,  339,  285,  703,  802,  304,  392,
        201,  328,  116,  293,   37,  530,   29,  312,  284,  507,  684,
        333,  322,  202,  739,  308,  467,  320,   64,  378, 1597,   60,
        109,   31,  593,  631,   32, 1529,  254,  314,  597,  207,  305,
        122,   66,  343,   59,  249,  406,  220,   51,  275,  479,   35,
        720,   70,  141,  395,  629,  502,  446,  131,  292,   68,  852,
        923,  953,  294,   74,  520,  171,  485,  732,  359, 1521,  800,
        615,  327,  236,  492,  298, 1138,  591,  786,  192,  388,  401,
        435,  223,  423,  634,  799,  444,  566,  274,   49,  376,  866,
         56, 1581,  279,  432,  516,  614,  650,   72,  474,  559, 1101,
        912,  690,  329, 1062,  688,  103,  194,  607,  398,  481, 2177,
        418,   94,  441,  165,  764,  297, 1273, 1574])

In [334]:
df.head(120)

      age           job   marital  education  balance  duration
0    58.0    management   married   tertiary     2143       261
1    44.0    technician    single  secondary       29       151
2    33.0  entrepreneur   married  secondary        2        76
3    47.0   blue-collar   married    unknown     1506        92
4    33.0       unknown    single    unknown        1       198
..    ...           ...       ...        ...      ...       ...
115  44.0   blue-collar   married  secondary      144       247
116  41.0        admin.   married  secondary      351       518
117  33.0    management    single   tertiary      -67       364
118  59.0    management  divorced   tertiary      262       178
119  57.0    technician   married    primary        0        98

[120 rows x 6 columns]

# Show your data in the given form below:

Note: age represents the average_age
Note: duration represents the max_duration

In [335]:
data=df.groupby('job').agg({'age':'mean','duration':'max'})

In [337]:
data

                     age  duration
job
admin.         40.787234      1677
blue-collar    42.773973      2177
entrepreneur   43.310345       746
housemaid      44.000000       699
management     42.642336      2033
retired        54.276596      1492
self-employed  43.884615       448
services       41.122137      1778
student        28.307692       611
technician     42.364865      1666
unemployed     41.478261       918
unknown        44.000000       347

# Show the table of the previous question after it by duration:

In [338]:
 data=data.sort_values(['duration'], ascending=True)

In [339]:
data

                     age  duration
job
unknown        44.000000       347
self-employed  43.884615       448
student        28.307692       611
housemaid      44.000000       699
entrepreneur   43.310345       746
unemployed     41.478261       918
retired        54.276596      1492
technician     42.364865      1666
admin.         40.787234      1677
services       41.122137      1778
management     42.642336      2033
blue-collar    42.773973      2177

# Use qcut method on age column to create a new column called age_divided that divides the customers into two categories (young_customers and old_customers):

In [340]:
age= pd.qcut(df['age'],q=2).value_counts()
age

(21.999, 42.0]    535
(42.0, 61.0]      465
Name: age, dtype: int64

In [341]:
age_divided=['young_customers','old_customers']
cut_bins=[0,21, 42,61]

In [342]:
df['age_divided']=pd.cut(df['age'],bins=[21,42,61],labels=age_divided)

In [343]:
df.head()

    age           job  marital  education  balance  duration      age_divided
0  58.0    management  married   tertiary     2143       261    old_customers
1  44.0    technician   single  secondary       29       151    old_customers
2  33.0  entrepreneur  married  secondary        2        76  young_customers
3  47.0   blue-collar  married    unknown     1506        92    old_customers
4  33.0       unknown   single    unknown        1       198  young_customers

# Show the average_age and max_duration of the divided customers like this:
hint: Use groupby method:

In [344]:
average=df.groupby('age_divided')[['age','duration']].aggregate({'age':'mean','duration':'max'})

In [345]:
average

                       age  duration
age_divided
young_customers  35.403738      2033
old_customers    50.840860      1778

#

# Git Part


1. What is Git?
- a) A nickname for GitHub
- b) A remote repository platform
- c) A programming language
- d) A version control system

answer
- d

#

 2. Why we use the Version Contol System ?

answer
-  It helps you keep track of changes made to your code during development and is also used to collaborate with other developers. Every person collaborating on a project repository has the exact same information that the other person has, including all commits and history.

- When you work locally on your system, you have a local repository. A remote repository exists somewhere outside your local machine, and it is possible to keep both in sync with each other.

#

 3. Which command should you use to initialize a new Git repository?


- a) git bash

- b) git install

- c) git init

- d) git start

answer
- c

3. After you initialize a new Git repository and create a file named **`git-quiz.html`** , which of the following commands will **NOT** work if issued?


-  a) **`git add`** git-quiz.html

- b) **`git status`**

- c) **`git add .`**

- d) **`git commit -m`** "git quiz web file added"

answer 
- d

#

# Problems

Problem_1

- problem_link
https://codeforces.com/problemset/problem/282/A

In [ ]:
n=int(input())
x=0
for _ in range(0,n):
    s=input()
    if "++" in s:
        x=x+1
    else:
        x=x-1
print(x)

Problem_2

- problem_link 
https://codeforces.com/group/T3p02rhrmb/contest/324959/problem/G

In [ ]:
import numpy as np
n=int(input())
x=np.sum(np.arange(1, n+1))
print(x)

# Use git to upload this notebook on Gitub and put the link: